; domain
(define (domain driverlog)
  (:requirements :typing :fluents) 
  (:types           location locatable - object
		driver truck obj - locatable)

  (:predicates 
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - obj ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x  - location ?y - location) 
		(path ?x  - location ?y - location)
		(empty ?v - truck)
)
  (:functions 	
		(time-to-drive ?l1 - location ?l2 - location)
		(fuel-used)
		(fuel-per-minute ?t - truck)
		(load ?t - truck)
  )


(:action LOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck) (increase (load ?truck) 1)
		(increase (fuel-per-minute ?truck) (+ (load ?truck) 1))))

(:action UNLOAD-TRUCK
  :parameters
   (?obj - obj
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc) (decrease (load ?truck) 1)
		(decrease (fuel-per-minute ?truck) (load ?truck))))


(:action BOARD-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action DISEMBARK-TRUCK
  :parameters
   (?driver - driver
    ?truck - truck
    ?loc - location)
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action DRIVE-TRUCK
  :parameters
   (?truck - truck
    ?loc-from - location
    ?loc-to - location
    ?driver - driver)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
		(increase (fuel-used) (* (fuel-per-minute ?truck) (time-to-drive ?loc-from ?loc-to)))))

(:action WALK
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))

 
)

; problem
(define (problem DLOG-4-6-3)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	s11 - location
	p0-3 - location
	p1-2 - location
	p1-4 - location
	p1-9 - location
	p3-0 - location
	p3-8 - location
	p3-9 - location
	p3-11 - location
	p4-10 - location
	p4-11 - location
	p5-7 - location
	p6-5 - location
	p6-11 - location
	p8-1 - location
	p8-3 - location
	p8-5 - location
	p8-7 - location
	p9-6 - location
	p10-0 - location
	p10-1 - location
	p10-6 - location
	p11-1 - location
	p11-7 - location
	)
	(:init
	(at driver1 s3)
	(at driver2 s8)
	(at driver3 s10)
	(at driver4 s7)
	(at truck1 s0)
	(empty truck1)
	(= (load truck1) 0)
	(= (fuel-per-minute truck1) 10)
	(at truck2 s4)
	(empty truck2)
	(= (load truck2) 0)
	(= (fuel-per-minute truck2) 10)
	(at truck3 s11)
	(empty truck3)
	(= (load truck3) 0)
	(= (fuel-per-minute truck3) 10)
	(at truck4 s11)
	(empty truck4)
	(= (load truck4) 0)
	(= (fuel-per-minute truck4) 10)
	(at truck5 s1)
	(empty truck5)
	(= (load truck5) 0)
	(= (fuel-per-minute truck5) 10)
	(at truck6 s1)
	(empty truck6)
	(= (load truck6) 0)
	(= (fuel-per-minute truck6) 10)
	(at package1 s10)
	(at package2 s0)
	(at package3 s11)
	(path s0 p0-3)
	(path p0-3 s0)
	(path s3 p0-3)
	(path p0-3 s3)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s1 p1-9)
	(path p1-9 s1)
	(path s9 p1-9)
	(path p1-9 s9)
	(path s3 p3-8)
	(path p3-8 s3)
	(path s8 p3-8)
	(path p3-8 s8)
	(path s3 p3-9)
	(path p3-9 s3)
	(path s9 p3-9)
	(path p3-9 s9)
	(path s3 p3-11)
	(path p3-11 s3)
	(path s11 p3-11)
	(path p3-11 s11)
	(path s4 p4-10)
	(path p4-10 s4)
	(path s10 p4-10)
	(path p4-10 s10)
	(path s4 p4-11)
	(path p4-11 s4)
	(path s11 p4-11)
	(path p4-11 s11)
	(path s5 p5-7)
	(path p5-7 s5)
	(path s7 p5-7)
	(path p5-7 s7)
	(path s6 p6-5)
	(path p6-5 s6)
	(path s5 p6-5)
	(path p6-5 s5)
	(path s6 p6-11)
	(path p6-11 s6)
	(path s11 p6-11)
	(path p6-11 s11)
	(path s8 p8-1)
	(path p8-1 s8)
	(path s1 p8-1)
	(path p8-1 s1)
	(path s8 p8-5)
	(path p8-5 s8)
	(path s5 p8-5)
	(path p8-5 s5)
	(path s8 p8-7)
	(path p8-7 s8)
	(path s7 p8-7)
	(path p8-7 s7)
	(path s9 p9-6)
	(path p9-6 s9)
	(path s6 p9-6)
	(path p9-6 s6)
	(path s10 p10-0)
	(path p10-0 s10)
	(path s0 p10-0)
	(path p10-0 s0)
	(path s10 p10-1)
	(path p10-1 s10)
	(path s1 p10-1)
	(path p10-1 s1)
	(path s10 p10-6)
	(path p10-6 s10)
	(path s6 p10-6)
	(path p10-6 s6)
	(path s11 p11-1)
	(path p11-1 s11)
	(path s1 p11-1)
	(path p11-1 s1)
	(path s11 p11-7)
	(path p11-7 s11)
	(path s7 p11-7)
	(path p11-7 s7)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 19)
	(= (time-to-drive s3 s0) 19)
	(link s0 s5)
	(link s5 s0)
	(= (time-to-drive s0 s5) 91)
	(= (time-to-drive s5 s0) 91)
	(link s0 s11)
	(link s11 s0)
	(= (time-to-drive s0 s11) 22)
	(= (time-to-drive s11 s0) 22)
	(link s2 s0)
	(link s0 s2)
	(= (time-to-drive s2 s0) 59)
	(= (time-to-drive s0 s2) 59)
	(link s2 s5)
	(link s5 s2)
	(= (time-to-drive s2 s5) 99)
	(= (time-to-drive s5 s2) 99)
	(link s2 s7)
	(link s7 s2)
	(= (time-to-drive s2 s7) 13)
	(= (time-to-drive s7 s2) 13)
	(link s2 s9)
	(link s9 s2)
	(= (time-to-drive s2 s9) 65)
	(= (time-to-drive s9 s2) 65)
	(link s2 s10)
	(link s10 s2)
	(= (time-to-drive s2 s10) 35)
	(= (time-to-drive s10 s2) 35)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 20)
	(= (time-to-drive s5 s3) 20)
	(link s4 s2)
	(link s2 s4)
	(= (time-to-drive s4 s2) 63)
	(= (time-to-drive s2 s4) 63)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 88)
	(= (time-to-drive s5 s4) 88)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 15)
	(= (time-to-drive s6 s4) 15)
	(link s4 s9)
	(link s9 s4)
	(= (time-to-drive s4 s9) 86)
	(= (time-to-drive s9 s4) 86)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 38)
	(= (time-to-drive s1 s5) 38)
	(link s5 s7)
	(link s7 s5)
	(= (time-to-drive s5 s7) 17)
	(= (time-to-drive s7 s5) 17)
	(link s5 s8)
	(link s8 s5)
	(= (time-to-drive s5 s8) 7)
	(= (time-to-drive s8 s5) 7)
	(link s6 s1)
	(link s1 s6)
	(= (time-to-drive s6 s1) 21)
	(= (time-to-drive s1 s6) 21)
	(link s6 s2)
	(link s2 s6)
	(= (time-to-drive s6 s2) 18)
	(= (time-to-drive s2 s6) 18)
	(link s6 s5)
	(link s5 s6)
	(= (time-to-drive s6 s5) 10)
	(= (time-to-drive s5 s6) 10)
	(link s6 s10)
	(link s10 s6)
	(= (time-to-drive s6 s10) 67)
	(= (time-to-drive s10 s6) 67)
	(link s6 s11)
	(link s11 s6)
	(= (time-to-drive s6 s11) 66)
	(= (time-to-drive s11 s6) 66)
	(link s7 s0)
	(link s0 s7)
	(= (time-to-drive s7 s0) 53)
	(= (time-to-drive s0 s7) 53)
	(link s7 s3)
	(link s3 s7)
	(= (time-to-drive s7 s3) 49)
	(= (time-to-drive s3 s7) 49)
	(link s7 s11)
	(link s11 s7)
	(= (time-to-drive s7 s11) 38)
	(= (time-to-drive s11 s7) 38)
	(link s8 s0)
	(link s0 s8)
	(= (time-to-drive s8 s0) 39)
	(= (time-to-drive s0 s8) 39)
	(link s8 s3)
	(link s3 s8)
	(= (time-to-drive s8 s3) 26)
	(= (time-to-drive s3 s8) 26)
	(link s8 s4)
	(link s4 s8)
	(= (time-to-drive s8 s4) 72)
	(= (time-to-drive s4 s8) 72)
	(link s8 s6)
	(link s6 s8)
	(= (time-to-drive s8 s6) 6)
	(= (time-to-drive s6 s8) 6)
	(link s8 s11)
	(link s11 s8)
	(= (time-to-drive s8 s11) 100)
	(= (time-to-drive s11 s8) 100)
	(link s9 s1)
	(link s1 s9)
	(= (time-to-drive s9 s1) 92)
	(= (time-to-drive s1 s9) 92)
	(link s9 s8)
	(link s8 s9)
	(= (time-to-drive s9 s8) 51)
	(= (time-to-drive s8 s9) 51)
	(link s10 s1)
	(link s1 s10)
	(= (time-to-drive s10 s1) 18)
	(= (time-to-drive s1 s10) 18)
	(link s10 s5)
	(link s5 s10)
	(= (time-to-drive s10 s5) 83)
	(= (time-to-drive s5 s10) 83)
	(link s10 s7)
	(link s7 s10)
	(= (time-to-drive s10 s7) 72)
	(= (time-to-drive s7 s10) 72)
	(link s11 s3)
	(link s3 s11)
	(= (time-to-drive s11 s3) 76)
	(= (time-to-drive s3 s11) 76)
	(= (fuel-used) 0)
)
	(:goal (and
	(at driver2 s4)
	(at driver3 s3)
	(at driver4 s8)
	(at truck1 s7)
	(at truck3 s5)
	(at truck4 s11)
	(at package1 s3)
	(at package2 s11)
	(at package3 s9)
	))

(:metric minimize (+ (* 4 (total-time)) (* 4 (fuel-used))))

)

; plan
1. (walk driver3 s10 p10-0)
   deleted: (at driver3 s10)
   added: (at driver3 p10-0)
   goals met: 1 of 9
2. (walk driver1 s3 p3-11)
   deleted: (at driver1 s3)
   added: (at driver1 p3-11)
   goals met: 1 of 9
3. (walk driver4 s7 p8-7)
   deleted: (at driver4 s7)
   added: (at driver4 p8-7)
   goals met: 1 of 9
4. (load-truck package2 truck1 s0)
   deleted: (at package2 s0)
   added: (in package2 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 1 of 9
5. (walk driver4 p8-7 s8)
   deleted: (at driver4 p8-7)
   added: (at driver4 s8)
   goals met: 2 of 9
6. (walk driver2 s8 p8-1)
   deleted: (at driver2 s8)
   added: (at driver2 p8-1)
   goals met: 2 of 9
7. (walk driver2 p8-1 s1)
   deleted: (at driver2 p8-1)
   added: (at driver2 s1)
   goals met: 2 of 9
8. (walk driver3 p10-0 s0)
   deleted: (at driver3 p10-0)
   added: (at driver3 s0)
   goals met: 2 of 9
9. (walk driver1 p3-11 s11)
   deleted: (at driver1 p3-11)
   added: (at driver1 s11)
   goals met: 2 of 9
10. (walk driver2 s1 p1-4)
   deleted: (at driver2 s1)
   added: (at driver2 p1-4)
   goals met: 2 of 9
11. (board-truck driver3 truck1 s0)
   deleted: (at driver3 s0) (empty truck1)
   added: (driving driver3 truck1)
   goals met: 2 of 9
12. (walk driver2 p1-4 s4)
   deleted: (at driver2 p1-4)
   added: (at driver2 s4)
   goals met: 3 of 9
13. (drive-truck truck1 s0 s7 driver3)
   deleted: (at truck1 s0)
   added: (at truck1 s7)
   changed: (fuel-used) from 0 to 583
   goals met: 4 of 9
14. (board-truck driver1 truck3 s11)
   deleted: (at driver1 s11) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 4 of 9
15. (load-truck package3 truck3 s11)
   deleted: (at package3 s11)
   added: (in package3 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 4 of 9
16. (drive-truck truck3 s11 s8 driver1)
   deleted: (at truck3 s11)
   added: (at truck3 s8)
   changed: (fuel-used) from 583 to 1683
   goals met: 4 of 9
17. (drive-truck truck3 s8 s9 driver1)
   deleted: (at truck3 s8)
   added: (at truck3 s9)
   changed: (fuel-used) from 1683 to 2244
   goals met: 4 of 9
18. (unload-truck package3 truck3 s9)
   deleted: (in package3 truck3)
   added: (at package3 s9)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 5 of 9
19. (drive-truck truck3 s9 s2 driver1)
   deleted: (at truck3 s9)
   added: (at truck3 s2)
   changed: (fuel-used) from 2244 to 2894
   goals met: 5 of 9
20. (drive-truck truck1 s7 s11 driver3)
   deleted: (at truck1 s7)
   added: (at truck1 s11)
   changed: (fuel-used) from 2894 to 3312
   goals met: 4 of 9
21. (unload-truck package2 truck1 s11)
   deleted: (in package2 truck1)
   added: (at package2 s11)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 5 of 9
22. (drive-truck truck3 s2 s10 driver1)
   deleted: (at truck3 s2)
   added: (at truck3 s10)
   changed: (fuel-used) from 3312 to 3662
   goals met: 5 of 9
23. (drive-truck truck1 s11 s7 driver3)
   deleted: (at truck1 s11)
   added: (at truck1 s7)
   changed: (fuel-used) from 3662 to 4042
   goals met: 6 of 9
24. (drive-truck truck1 s7 s10 driver3)
   deleted: (at truck1 s7)
   added: (at truck1 s10)
   changed: (fuel-used) from 4042 to 4762
   goals met: 5 of 9
25. (load-truck package1 truck1 s10)
   deleted: (at package1 s10)
   added: (in package1 truck1)
   changed: (load truck1) from 0 to 1, (fuel-per-minute truck1) from 10 to 11
   goals met: 5 of 9
26. (drive-truck truck3 s10 s5 driver1)
   deleted: (at truck3 s10)
   added: (at truck3 s5)
   changed: (fuel-used) from 4762 to 5592
   goals met: 6 of 9
27. (disembark-truck driver3 truck1 s10)
   deleted: (driving driver3 truck1)
   added: (at driver3 s10) (empty truck1)
   goals met: 6 of 9
28. (unload-truck package1 truck1 s10)
   deleted: (in package1 truck1)
   added: (at package1 s10)
   changed: (load truck1) from 1 to 0, (fuel-per-minute truck1) from 11 to 10
   goals met: 6 of 9
29. (drive-truck truck3 s5 s10 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s10)
   changed: (fuel-used) from 5592 to 6422
   goals met: 5 of 9
30. (load-truck package1 truck3 s10)
   deleted: (at package1 s10)
   added: (in package1 truck3)
   changed: (load truck3) from 0 to 1, (fuel-per-minute truck3) from 10 to 11
   goals met: 5 of 9
31. (drive-truck truck3 s10 s5 driver1)
   deleted: (at truck3 s10)
   added: (at truck3 s5)
   changed: (fuel-used) from 6422 to 7335
   goals met: 6 of 9
32. (drive-truck truck3 s5 s3 driver1)
   deleted: (at truck3 s5)
   added: (at truck3 s3)
   changed: (fuel-used) from 7335 to 7555
   goals met: 5 of 9
33. (walk driver3 s10 p10-0)
   deleted: (at driver3 s10)
   added: (at driver3 p10-0)
   goals met: 5 of 9
34. (walk driver3 p10-0 s0)
   deleted: (at driver3 p10-0)
   added: (at driver3 s0)
   goals met: 5 of 9
35. (unload-truck package1 truck3 s3)
   deleted: (in package1 truck3)
   added: (at package1 s3)
   changed: (load truck3) from 1 to 0, (fuel-per-minute truck3) from 11 to 10
   goals met: 6 of 9
36. (walk driver3 s0 p0-3)
   deleted: (at driver3 s0)
   added: (at driver3 p0-3)
   goals met: 6 of 9
37. (walk driver3 p0-3 s3)
   deleted: (at driver3 p0-3)
   added: (at driver3 s3)
   goals met: 7 of 9
38. (walk driver2 s4 p4-10)
   deleted: (at driver2 s4)
   added: (at driver2 p4-10)
   goals met: 6 of 9
39. (walk driver2 p4-10 s10)
   deleted: (at driver2 p4-10)
   added: (at driver2 s10)
   goals met: 6 of 9
40. (board-truck driver2 truck1 s10)
   deleted: (at driver2 s10) (empty truck1)
   added: (driving driver2 truck1)
   goals met: 6 of 9
41. (drive-truck truck1 s10 s7 driver2)
   deleted: (at truck1 s10)
   added: (at truck1 s7)
   changed: (fuel-used) from 7555 to 8275
   goals met: 7 of 9
42. (drive-truck truck3 s3 s7 driver1)
   deleted: (at truck3 s3)
   added: (at truck3 s7)
   changed: (fuel-used) from 8275 to 8765
   goals met: 7 of 9
43. (disembark-truck driver2 truck1 s7)
   deleted: (driving driver2 truck1)
   added: (at driver2 s7) (empty truck1)
   goals met: 7 of 9
44. (drive-truck truck3 s7 s5 driver1)
   deleted: (at truck3 s7)
   added: (at truck3 s5)
   changed: (fuel-used) from 8765 to 8935
   goals met: 8 of 9
45. (disembark-truck driver1 truck3 s5)
   deleted: (driving driver1 truck3)
   added: (at driver1 s5) (empty truck3)
   goals met: 8 of 9
46. (walk driver2 s7 p11-7)
   deleted: (at driver2 s7)
   added: (at driver2 p11-7)
   goals met: 8 of 9
47. (walk driver2 p11-7 s11)
   deleted: (at driver2 p11-7)
   added: (at driver2 s11)
   goals met: 8 of 9
48. (walk driver2 s11 p4-11)
   deleted: (at driver2 s11)
   added: (at driver2 p4-11)
   goals met: 8 of 9
49. (walk driver2 p4-11 s4)
   deleted: (at driver2 p4-11)
   added: (at driver2 s4)
   goals met: 9 of 9
